# BTK PYTHON

In [ ]:
b={"a":10,
    "b":20,
    "c":30}

In [ ]:
for i in b:
    print(i)

In [ ]:
for i,j in b.items():
    print(i,j)

In [16]:
bl =[5,10,15,20,25,30]
for i in bl:
    bl.append(i/5)
    if(i==30): break
bl

[5, 10, 15, 20, 25, 30, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0]

In [ ]:
for i in b:
    b.update("z","x","v",i)
b

In [22]:
x=0
while x<10:
    print("Merhaba")
    x+=1

Merhaba
Merhaba
Merhaba
Merhaba
Merhaba
Merhaba
Merhaba
Merhaba
Merhaba
Merhaba

In [24]:
bl.pop()

6.0

In [25]:
bl

[5, 10, 15, 20, 25, 30, 1.0, 2.0, 3.0, 4.0, 5.0]

In [26]:
while x>=0:
    bl.append(x*2)
    x-=1
bl

[5,
 10,
 15,
 20,
 25,
 30,
 1.0,
 2.0,
 3.0,
 4.0,
 5.0,
 20,
 18,
 16,
 14,
 12,
 10,
 8,
 6,
 4,
 2,
 0]

In [28]:
for i in bl:
    if i%3==0:
        print(f"Değer :{i}")

Değer :15
Değer :30
Değer :3.0
Değer :18
Değer :12
Değer :6
Değer :0

In [29]:
bl2=[0,1,2,3,4,5,6]

In [32]:
bl2=list(range(15))
bl2

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [33]:
for i in list(range(16)):
    print(i*10)

0
10
20
30
40
50
60
70
80
90
100
110
120
130
140
150

In [34]:
list(range(5,20,2))

[5, 7, 9, 11, 13, 15, 17, 19]

Enumarate

In [35]:
index =0

In [36]:
for n in list(range(5,15)):
    print(f"Olan sayı :{n} oluşturulan {n*2}")

Olan sayı :5 oluşturulan 10
Olan sayı :6 oluşturulan 12
Olan sayı :7 oluşturulan 14
Olan sayı :8 oluşturulan 16
Olan sayı :9 oluşturulan 18
Olan sayı :10 oluşturulan 20
Olan sayı :11 oluşturulan 22
Olan sayı :12 oluşturulan 24
Olan sayı :13 oluşturulan 26
Olan sayı :14 oluşturulan 28

In [44]:
a=list(range(10,20))
a

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [45]:
for i in enumerate(a):
    print(i)

(0, 10)
(1, 11)
(2, 12)
(3, 13)
(4, 14)
(5, 15)
(6, 16)
(7, 17)
(8, 18)
(9, 19)

Random

In [48]:
from random import randint

In [49]:
randint(0,100)

67

In [55]:
for i in range(10):
    print(i,randint(0,100))

0 95
1 64
2 35
3 49
4 70
5 66
6 58
7 51
8 7
9 64

In [56]:
l1=list(range(0,10))
l1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [57]:
from random import shuffle

In [58]:
shuffle(l1)

In [59]:
l1

[8, 4, 9, 6, 1, 2, 0, 5, 3, 7]

## Zip (Sıkıştırmak)

In [60]:
yemek=["muz","ananas","elma"]
kalori=[100,200,300]
gun=["pzt","salı","çar"]

In [61]:
ziplis=list(zip(yemek,kalori,gun))
ziplis

[('muz', 100, 'pzt'), ('ananas', 200, 'salı'), ('elma', 300, 'çar')]

In [62]:
type(ziplis)

list

In [64]:
type(ziplis[0])

tuple

In [65]:
liste1=[]
s3="Ahmet Sarıcı"
for i in s3:
    liste1.append(i)

In [66]:
liste1

['A', 'h', 'm', 'e', 't', ' ', 'S', 'a', 'r', 'ı', 'c', 'ı']

In [67]:
liste2=[i for i in s3]
liste2

['A', 'h', 'm', 'e', 't', ' ', 'S', 'a', 'r', 'ı', 'c', 'ı']

In [68]:
liste3 =[n*5 for n in list(range(0,10))]
liste3

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

## Fonksiyon

In [69]:
ad="Ahmet Sarıcı"

In [70]:
ad.upper()

'AHMET SARICI'

In [71]:
ad

'Ahmet Sarıcı'

In [72]:
help(ad.upper())

No Python documentation found for 'AHMET SARICI'.
Use help() to get the interactive help utility.
Use help(str) for help on the str class.

In [74]:
def ilk(x):
    for i in x:
        print(i)

In [75]:
ilk(ad)

A
h
m
e
t

S
a
r
ı
c
ı

## Args & Kargs (Argümanlar ve Anahtar Argümanlar)

In [76]:
def yenitop (*args):
    return sum(args)

In [78]:
yenitop(10,20,25)

55

In [79]:
type(yenitop(10,20,25))

int

In [80]:
def yenitop2 (*args):
    return sum(args)

In [81]:
yenitop2(10,20,25)

55

In [82]:
type(yenitop(10,20,25))

int

In [83]:
def yeni2 (*args):
    return args

In [84]:
yeni2(2,4,6)

(2, 4, 6)

In [85]:
type(yeni2(2,4,6))

tuple

In [86]:
def ornk1(**kwargs):
    print(kwargs)

In [87]:
ornk1(m=100, n=200, v=300)

{'m': 100, 'n': 200, 'v': 300}

In [88]:
type(ornk1(m=100, n=200, v=300))

{'m': 100, 'n': 200, 'v': 300}

NoneType

In [90]:
def ornk2(**kwargs):
    return kwargs

In [91]:
ornk2(m=100, n=200, v=300)

{'m': 100, 'n': 200, 'v': 300}

In [93]:
type(ornk2(m=100, n=200, v=300))

dict

In [1]:
def ayeni(*args):
    return sum(args)

In [2]:
ayeni(10,20,30,55,46,78,9)

248

In [5]:
def a1yeni(*args):
    return args

In [6]:
type(a1yeni(20,30,40))

tuple

In [8]:
def kyeni(**kwargs):
    print(kwargs)

## Faydalı FOnksiyonlar

In [11]:
blistem=list(range(1,11))
blistem

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [13]:
blistem*2

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

Map

In [15]:
map (lambda x:x/2,blistem)

In [16]:
list(map (lambda x:x/2,blistem))

[0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0]

Filter

In [17]:
list(filter(lambda x:x%2==0, blistem))

[2, 4, 6, 8, 10]

In [18]:
carp = lambda n:n*3

In [19]:
carp(30)

90

In [21]:
list(map(carp,blistem))

[3, 6, 9, 12, 15, 18, 21, 24, 27, 30]

In [22]:
list(map(lambda x:x*10,blistem))

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

## OOP

### Instance & Attribute (Örnek/Nesne & Özellikler)

In [49]:
class Vb():
    def guc(self):
        print(f"Ben {self.isim}, kahramanım!")
    def __init__(self, ad,yas,meslek):

        print("Çağırıldı")
        self.isim=ad
        self.yas=yas
        self.meslek=meslek

In [50]:
s1=Vb("Superman",33,"Gazeteci")

Çağırıldı

In [51]:
s1.meslek

'Gazeteci'

In [52]:
s1.meslek='GZT'

In [53]:
s1.meslek

'GZT'

In [54]:
s1.guc()

Ben Superman, kahramanım!

In [64]:
class Kopek():
    def iyas(self):
        print(f"İnsan yaşım :{self.yas*5}")
    def __init__(self,yas=5) -> None:
        self.yas=yas

In [71]:
bk=Kopek(3)

In [72]:
bk.yas

3

In [73]:
bk2=Kopek()
bk.yas

3

In [74]:
bk2.iyas()

İnsan yaşım :25

In [76]:
bk.iyas()

İnsan yaşım :15

### Inheritance (Miras/Kalıtım)

In [1]:
class Hayvan():
    def __init__(self):
        print("Hayvan Sınıfı init çağırıldı")
    def m1(self):
        print("Hayvan Sınıfı M1 çağırıldı")    
    def m2(self):
        print("Hayvan Sınıfı M2 çağırıldı")

In [2]:
bh=Hayvan()

Hayvan Sınıfı init çağırıldı

In [5]:
bh.m1()

Hayvan Sınıfı M1 çağırıldı

In [13]:
class kedi(Hayvan):
    def __init__(self):
        Hayvan.__init__(self)
        print("Kedi sınıfı init çağırıldı")
    def mi(self):
        print("Miyavla")   
    def m2(self):
        print("Kedi kedi")

In [15]:
kd=kedi()

Hayvan Sınıfı init çağırıldı
Kedi sınıfı init çağırıldı

In [11]:
kd.m1()

Hayvan Sınıfı M1 çağırıldı

In [12]:
kd.mi()

Miyavla

In [16]:
kd.m2()

Kedi kedi

**Polimorfizm**

In [17]:
class elma():
    def __init__(self,isim):
        self.isim=isim
    def bilgiv(self):
        return self.isim+" 100 kaloridir"

In [18]:
class muz():
    def __init__(self,isim):
        self.isim=isim
    def bilgiv(self):
        return self.isim+" 150 kaloridir"

In [19]:
e1=elma("1elma")

In [20]:
e1.bilgiv()

'1elma 100 kaloridir'

In [21]:
m1=muz("muz")
m1.bilgiv()

'muz 150 kaloridir'

In [23]:
meyvelis=[e1,m1]

In [24]:
for i in meyvelis:
    print(i.bilgiv())

1elma 100 kaloridir
muz 150 kaloridir

In [25]:
def bal(meyve):
    print(meyve.bilgiv())

In [27]:
bal(m1)

muz 150 kaloridir

In [28]:
bal(e1)

1elma 100 kaloridir

**Özel Metodlar**

In [46]:
class meyve1():
    def __init__(self,isim,kalori):
        self.isim=isim
        self.kalori=kalori
    def __str__(self):
        return f"{self.isim} şu kadar kalori: {self.kalori}" 
    def __len__(self):
        return self.kalori

In [37]:
m2=meyve1("muzz",150)

In [38]:
m2.kalori

150

In [39]:
print(m2)

<__main__.meyve1 object at 0x000002183D32E970>

In [40]:
benimlis=[1,2,3,"a",4,5]

In [41]:
print(benimlis)

[1, 2, 3, 'a', 4, 5]

In [42]:
len(benimlis)

6

In [47]:
e3=meyve1("Elma",200)

In [48]:
len(e3)

200

In [49]:
print(e3)

Elma şu kadar kalori: 200

## Eksik Veriler

In [4]:
import pandas as pd
import numpy as np

In [6]:
soz={"istanbul":[30,29,np.nan],
     "ankara":[20,np.nan,30],
     "izmir":[40,39,38]}
soz

{'istanbul': [30, 29, nan], 'ankara': [20, nan, 30], 'izmir': [40, 39, 38]}

In [7]:
hava=pd.DataFrame(soz)
hava

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    30.0     38

In [8]:
hava.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [9]:
hava

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    30.0     38

In [10]:
hava.fillna(1)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     1.0     39
2       1.0    30.0     38

In [15]:
hava["antalya"]=[40,np.nan,np.nan]
hava

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    30.0     38      NaN

In [17]:
hava.dropna(axis=1, thresh=2) #sütunlarda ikiden fazla nan varsa at

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    30.0     38

In [19]:
np.mean(soz["izmir"])

39.0

In [32]:
hava

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    30.0     38      NaN

In [33]:
hava.fillna(np.mean(soz["izmir"]))

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     40.0
1      29.0    39.0     39     39.0
2      39.0    30.0     38     39.0

## Gruplandırma (groupby)

In [42]:
maas ={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
       "calisan isim":["ahmet","mehmet","fatma","gül","canan","burak"],
       "maas":[100,150,200,300,400,500]}
mdf=pd.DataFrame(maas)
mdf

   departman calisan isim  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama        fatma   200
3  pazarlama          gül   300
4      hukuk        canan   400
5      hukuk        burak   500

In [43]:
gp=mdf.groupby("departman")
gp.count()

           calisan isim  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [44]:
gp.mean()

            maas
departman
hukuk      450.0
pazarlama  250.0
yazılım    125.0

In [45]:
gp.sum()

           maas
departman
hukuk       900
pazarlama   500
yazılım     250

In [46]:
gp.max()

          calisan isim  maas
departman
hukuk            canan   500
pazarlama          gül   300
yazılım         mehmet   150

In [47]:
gp.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concat

In [48]:
import numpy as np
import pandas as pd

In [49]:
a=[1,2,3,4,5,6,7]
b=["a","b","c","d","e","f","g"]
c=[2,4,6,8,10,12,14]

In [53]:
soz2={"isim":["ahmet","mehmet","zeynep","atıl"],
      "spor":["koşu","yüzme","koşu","basketbol"],
      "kalori":[100,200,300,400]}
df1=pd.DataFrame(soz2, index=[0,1,2,3])      
df1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     300
3    atıl  basketbol     400

In [55]:
soz3={"isim":["osman","levent","atlas","fatma"],
      "spor":["koşu","yüzme","koşu","basketbol"],
      "kalori":[200,100,50,300]}
df3=pd.DataFrame(soz2, index=[4,5,6,7])      
df3

     isim       spor  kalori
4   ahmet       koşu     100
5  mehmet      yüzme     200
6  zeynep       koşu     300
7    atıl  basketbol     400

In [56]:
soz4={"isim":["ayşe","mahmut","duygu","nur"],
      "spor":["koşu","yüzme","badminton","tenis"],
      "kalori":[300,400,500,250]}
df4=pd.DataFrame(soz2, index=[8,9,10,11])      
df4

      isim       spor  kalori
8    ahmet       koşu     100
9   mehmet      yüzme     200
10  zeynep       koşu     300
11    atıl  basketbol     400

In [58]:
pd.concat([df1,df3,df4])

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yüzme     200
2   zeynep       koşu     300
3     atıl  basketbol     400
4    ahmet       koşu     100
5   mehmet      yüzme     200
6   zeynep       koşu     300
7     atıl  basketbol     400
8    ahmet       koşu     100
9   mehmet      yüzme     200
10  zeynep       koşu     300
11    atıl  basketbol     400

## Merge

In [59]:
soz5={"isim":["ayşe","mahmut","duygu","nur"],
      "spor":["koşu","yüzme","badminton","tenis"],
      }
df5=pd.DataFrame(soz5)      
df5

     isim       spor
0    ayşe       koşu
1  mahmut      yüzme
2   duygu  badminton
3     nur      tenis

In [61]:
soz6={"isim":["ayşe","mahmut","duygu","nur"],
      "kalori":[300,400,500,250]}
df6=pd.DataFrame(soz6)      
df6

     isim  kalori
0    ayşe     300
1  mahmut     400
2   duygu     500
3     nur     250

In [63]:
pd.merge(df5,df6, on="isim") #ortak kolon seçerek birleştirme

     isim       spor  kalori
0    ayşe       koşu     300
1  mahmut      yüzme     400
2   duygu  badminton     500
3     nur      tenis     250

In [64]:
maas2 ={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
       "calisan isim":["ahmet","mehmet","fatma","gül","canan","burak"],
       "maas":[100,150,200,300,400,500]}
mdf2=pd.DataFrame(maas2)
mdf2

   departman calisan isim  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama        fatma   200
3  pazarlama          gül   300
4      hukuk        canan   400
5      hukuk        burak   500

In [65]:
mdf2["departman"]

0      yazılım
1      yazılım
2    pazarlama
3    pazarlama
4        hukuk
5        hukuk
Name: departman, dtype: object

In [69]:
mdf2["departman"].unique() #departman türleri neler

array(['yazılım', 'pazarlama', 'hukuk'], dtype=object)

In [70]:
mdf2["departman"].nunique() #kaç tür departman var

3

In [71]:
mdf2["departman"].value_counts()

yazılım      2
pazarlama    2
hukuk        2
Name: departman, dtype: int64

In [84]:
def buruttennete(maas):
    return maas*0.66

In [85]:
mdf2["maas"].apply(buruttennete)

0     66.0
1     99.0
2    132.0
3    198.0
4    264.0
5    330.0
Name: maas, dtype: float64

In [87]:
mdf2.isnull() #null değer var mı

   departman  calisan isim   maas
0      False         False  False
1      False         False  False
2      False         False  False
3      False         False  False
4      False         False  False
5      False         False  False

Pivot table

In [88]:
mdf2

   departman calisan isim  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama        fatma   200
3  pazarlama          gül   300
4      hukuk        canan   400
5      hukuk        burak   500

In [89]:
mdf2.pivot_table(values="maas",index=["departman","calisan isim"])

                        maas
departman calisan isim
hukuk     burak          500
          canan          400
pazarlama fatma          200
          gül            300
yazılım   ahmet          100
          mehmet         150

In [90]:
mdf2.pivot_table(values="maas",index=["calisan isim","departman"])

                        maas
calisan isim departman
ahmet        yazılım     100
burak        hukuk       500
canan        hukuk       400
fatma        pazarlama   200
gül          pazarlama   300
mehmet       yazılım     150

In [97]:
#mdf2.pivot_table(values="maas",index=["calisan isim","departman"],aggfunc=np.sum)